/** @type {import('tailwindcss').Config} */
module.exports = {
  // 🔥 ส่วนสำคัญ: บอกให้ Tailwind วิ่งหาไฟล์ HTML ให้ทั่วทั้งโปรเจกต์
  content: [
    // 1. หาในโฟลเดอร์ templates หลักที่หน้าบ้าน (ตามรูปภาพของคุณ)
    './templates/**/*.html',
    
    // 2. หาในโฟลเดอร์ templates ของทุก App (เช่น booking, users, car_rental)
    // การใช้ ** จะช่วยให้มันมุดเข้าไปหาในโฟลเดอร์ย่อยๆ ได้เองครับ
    './**/templates/**/*.html',
    
    // 3. หาในไฟล์ Python เผื่อมีการเขียน Class ใน forms.py หรือ views.py
    './**/*.py',
    
    // 4. หาในไฟล์ JavaScript
    './static/**/*.js',
  ],
  theme: {
    extend: {
      fontFamily: {
        sarabun: ['Sarabun', 'sans-serif'],
      },
      colors: {
        'warp-blue': '#47B3C4',
        'warp-blue-dark': '#3a9faa',
      }
    },
  },
  plugins: [],
}